garyPenhook/PyAvrOCD/svd/avr32la20.svd
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPRDY</name>
              <description>Sample Ready Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCMP</name>
              <description>Window Comparator Interrupt Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESOVR</name>
              <description>Result Overwrite Interrupt Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPOVR</name>
              <description>Sample Overwrite Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOVR</name>
              <description>Trigger Overrun Interrupt Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUXPOS</name>
          <description>Positive Input Multiplexer</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXPOS</name>
              <description>Positive Input Multiplexer</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN22</name>
                  <description>ADC input pin 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN23</name>
                  <description>ADC input pin 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN24</name>
                  <description>ADC input pin 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN25</name>
                  <description>ADC input pin 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN26</name>
                  <description>ADC input pin 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN27</name>
                  <description>ADC input pin 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE</name>
                  <description>Temperature Sensor</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDDIV10</name>
                  <description>VDD Divided by 10</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0REFSCALE</name>
                  <description>AC0 Reference Scaler</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC</name>
                  <description>Peripheral Touch Controller</description>
                  <value>62</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result</description>
          <addressOffset>0xC</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>ADC Result</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLE</name>
          <description>Sample</description>
          <addressOffset>0xE</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPLE</name>
              <description>ADC Sample</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADCBUSY</name>
              <description>ADC Busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temporary</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEMP</name>
              <description>Temporary</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WINHT</name>
          <description>Window High Threshold</description>
          <addressOffset>0x12</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WINHT</name>
              <description>Window High Threshold</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WINLT</name>
          <description>Window Low Threshold</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WINLT</name>
              <description>Window Low Threshold</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
